Repository: takawoeiji/flutter_meditation
Catalog: lib/l10n/app_*.arb
Languages: hy, mg, mi, mk, mn, or, ps, rw, sd, tg, tt, ug, yi

source: hello
hy: Բարեւ Ձեզ
mg: Salama
mi: ora
mk: Здраво
mn: Сайн уу
or: ନମସ୍କାର
ps: سلام
rw: muraho
sd: سلام
tg: Салом
tt: Сәлам
ug: ياخشىمۇسىز
yi: אַ גוטן

# title
source: Flutter Demo Home Page
hy: Flutter Demo գլխավոր էջ
mg: Pejin'ny trano Demo Butter
mi: Paetukutuku Flutter Dromo Whārangi
mk: Демо почетна страница на флатер
mn: Flutter Demo Home хуудас
or: ଫ୍ଲୁଟର୍ ଡେମୋ ମୂଳପୃଷ୍ଠା |
ps: د فلټر ډیمو کور پا .ه
rw: Page ya demo demo
sd: فلٽر ڊيمو گهر جو صفحو
tg: Flacker Саҳифаи намоишӣ
tt: Тәртип Демо Баш бит
ug: Flutter Dame باش بېتى
yi: פלאָנט דעמאָ היים בלאַט

# message
source: You have pushed the button this many times
hy: Դուք այս բազմիցս հրել եք կոճակը
mg: Nanosika ny bokotra ity imbetsaka ianao
mi: Kua peia e koe te paatene i tenei wa maha
mk: Го туркавте копчето ова многу пати
mn: Та энэ товчийг дарсан байна
or: ଆପଣ ଏହାକୁ ଅନେକ ଥର ବଟନ୍ କୁ ଠେଲି ଦେଇଛନ୍ତି |
ps: تاسو د دې ډیری وختونو ت button ۍ اړولی
rw: Wasunitse buto ibi inshuro nyinshi
sd: توهان هن کي ڪيترائي ڀيرا بٽڻ دٻايو آهي
tg: Шумо чандин маротиба тугмаро тела додаед
tt: Сез бу күп тапкыр төймәгә этәрдегез
ug: سىز بۇ كۇنۇپكىنى ئىتتىرىۋەتتىڭىز
yi: איר האָט פּושט די קנעפּל אַזוי פילע מאָל

# msgEmailError
source: Please enter a valid email address.
hy: Խնդրում ենք մուտքագրել գործող էլեկտրոնային հասցե.
mg: Mampidira adiresy mailaka mandeha azafady.
mi: Tomo koa ki tetahi wahitau imeera whai mana.
mk: Ве молиме внесете валидна е-маил адреса.
mn: Зөв имэйл хаягаа оруулна уу.
or: ଦୟାକରି ଏକ ବ valid ଧ ଇମେଲ୍ ଠିକଣା ପ୍ରବେଶ କରନ୍ତୁ |
ps: مهرباني وکړئ یو معتبر بریښنالیک پته دننه کړئ.
rw: Nyamuneka andika aderesi imeri yemewe.
sd: مهرباني ڪري صحيح اي ميل پتو داخل ڪريو.
tg: Лутфан нишонаи имейли амалкунандаро ворид намоед.
tt: Нәзакәтле электрон почта адресын кертегез.
ug: ئىناۋەتلىك ئېلېكترونلۇق خەت ئادرېسىنى كىرگۈزۈڭ.
yi: ביטע לייג אריין א ריכטיגע אימעיל אדרעסס.

# msgNameError
source: Please enter at least 4 characters.
hy: Խնդրում ենք մուտքագրել առնվազն 4 նիշ:
mg: Ampidiro azafady ny litera 4 farafahakeliny.
mi: Tomo koa ki te neke atu i te 4 nga kiripuaki.
mk: Внесете најмалку 4 карактери.
mn: Дор хаяж 4 тэмдэгт оруулна уу.
or: ଦୟାକରି ଅତିକମରେ 4 ଅକ୍ଷର ପ୍ରବେଶ କରନ୍ତୁ |
ps: مهرباني وکړئ لږترلږه 4 حروف دننه کړئ.
rw: Nyamuneka andika byibuze inyuguti 4.
sd: مهرباني ڪري گهٽ ۾ گهٽ 4 اکرن ۾ داخل ڪريو.
tg: Лутфан на камтар аз 4 аломатро ворид кунед.
tt: Зинһар, ким дигәндә 4 символ кертегез.
ug: كەم دېگەندە 4 ھەرپ كىرگۈزۈڭ.
yi: ביטע אַרייַן אין מינדסטער 4 אותיות.

# msgPswdError
source: Password must be at least 7 charactors long.
hy: Գաղտնաբառը պետք է լինի առնվազն 7 բարերար:
mg: Ny tenimiafina dia tsy tokony ho 7 fisolokiana farafahakeliny 7.
mi: Ko te kupuhipa me neke atu i te 7 nga hoia roa.
mk: Лозинката мора да биде долга најмалку 7 карактери.
mn: Нууц үг нь дор хаяж 7 дүрмийн урт байх ёстой.
or: ପାସୱାର୍ଡ ଅତିକମରେ 7 ଟି କୀଟର ଲମ୍ବା ହେବା ଜରୁରୀ |
ps: رمز باید لږترلږه 7 فاکتورونه اوږد وي.
rw: Ijambobanga rigomba kuba byibuze abakaramu 7.
sd: پاسورڊ گهٽ ۾ گهٽ 7 ڪڪرن وارا ڊگها هجڻ گهرجن.
tg: Рамз бояд ҳадди аққал 7 контактор бошад.
tt: Серсүз ким дигәндә 7 харатор булырга тиеш.
ug: پارول كەم دېگەندە 7 خىل خاراكتېر بولۇشى كېرەك.
yi: שפּריכוואָרט מוזן זיין אין מינדסטער 7 טשאַלאַקטטערז.

source: email address
hy: էլեկտրոնային հասցե
mg: adiresy mailaka
mi: Wāhitau Emailmera
mk: и-мејл адреса
mn: имэйл хаяг
or: ଈମୈଲ ଠିକଣା
ps: بریښنا‌لیک
rw: aderesi imeri
sd: اي ميل پتو
tg: суроғаи имэйл
tt: мэйл адресы
ug: ئېلخەت ئادرېسى
yi: אימעיל אדרעס

source: User name
hy: Օգտագործողի անունը
mg: Anaran'ny mpampiasa
mi: Ingoa Kaiwhakamahi
mk: Корисничко име
mn: Скэдхэн нэр
or: ବ୍ୟବହାରକାରୀ ନାମ
ps: د کارونکي نوم
rw: Izina ryumukoresha
sd: استعمال ڪندڙ نالو
tg: Номи корбар
tt: Кулланучы исеме
ug: ئىشلەتكۈچى ئىسمى
yi: באַניצער נאמען

source: Password
hy: Գաղտնաբառ
mi: Kupu whakataha
mk: Лозинка
mn: Нууц үг
or: ପାସୱାର୍ଡ
ps: رمز
rw: Ijambo ryibanga
sd: پاسورڊ
tg: Номи махфӣ
tt: Серсүз
ug: پارول
yi: פּאַראָל

source: Create new account
hy: Ստեղծեք նոր հաշիվ
mg: Mamorona kaonty vaovao
mi: Waihangahia he Pūkete Hou
mk: Создадете нова сметка
mn: Шинэ данс үүсгэх
or: ନୂତନ ଖାତା ସୃଷ୍ଟି କରନ୍ତୁ |
ps: نوی حساب جوړ کړه
rw: Kora konti nshya
sd: نئون کاتو ٺاهيو
tg: Эҷоди ҳисоби нав
tt: Яңа хисап язмасы төзегез
ug: يېڭى ھېسابات قۇر
yi: שאַפֿן נייַע אַקאַונט

source: Login
hy: Մուտք
mg: Hiditra
mi: Takiuru
mk: Логирај Се
mn: Нэвтрэх
or: ଭିତରକୁ ଯାଉ
ps: د ننه کیدل
rw: Injira
sd: لاگ ان ٿيو
tg: Даромадан
tt: Керергә
ug: كىرىش
yi: צייכן אריין

source: Logout
hy: Տնկիլ
mg: Miala
mi: Manga
mk: Логаж
mn: Гарах
or: ପ୍ରସ୍ଥାନ କର
ps: وتل
rw: Gusohoka
sd: ڪم ڇڏڻ
tg: Баромадан
tt: Чыгарга
ug: چېكىنىش
yi: לאָגאָ

source: Sign up
hy: Գրանցվել
mg: Hiditra Mpikambana
mi: Takiuru
mk: Пријавете се
mn: Бүртгүүлэх
or: ସାଇନ୍ ଅପ୍ କରନ୍ତୁ
ps: ګډون کول
rw: Iyandikishe
sd: سائن اپ ڪريو
tg: қайд кардан
tt: Теркәлергә
ug: تىزىملىتىڭ
yi: פאַרשרייַבן

# have_accouont
source: I already have a account
hy: Ես արդեն հաշիվ ունեմ
mg: Efa manana kaonty aho
mi: Kei a au he putea
mk: Јас веќе имам сметка
mn: Надад аль хэдийн данс байна
or: ମୋର ପୂର୍ବରୁ ଏକ ଆକାଉଣ୍ଟ୍ ଅଛି |
ps: زه دمخه حساب لرم
rw: Mfite konti
sd: مون وٽ اڳ ۾ ئي هڪ اڪائونٽ آهي
tg: Ман аллакай ҳисоб дорам
tt: Минем хисап язмасы бар
ug: مېنىڭ ئاللىبۇرۇن ھېساباتىم بار
yi: איך שוין האָבן אַ חשבון

# category_title
source: Category
mi: Momo
rw: Icyiciro
sd: مواد مسلسل
ug: Callo
yi: קאַטעגאָריע
